# ── Taps ──────────────────────────────────────────────────
tap "anthropics/claude"
tap "launchdarkly/tap"
tap "nikitabobko/tap"   # Aerospace
tap "steveyegge/beads"
tap "withgraphite/tap"

# ── Shell & Terminal ──────────────────────────────────────
brew "starship"
brew "tmux"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# ── CLI Tools ─────────────────────────────────────────────
# File & Search
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
# System
brew "cloc"
brew "htop"
brew "neovim"
brew "cmark"
# Cloud & APIs
brew "awscli"
brew "gh"
brew "ldcli"

# ── Languages & Runtimes ─────────────────────────────────
brew "python@3.13"
brew "clojure"
brew "node"
brew "node@24"
brew "fnm"
brew "n"
brew "nvm"

# ── Formatters & Linters ─────────────────────────────────
brew "biome"
brew "buf"

# ── Databases ─────────────────────────────────────────────
brew "mysql@8.0"
brew "opensearch"
brew "postgresql@16"
brew "postgresql@17"
brew "redis"

# ── Workflow ──────────────────────────────────────────────
brew "beads", link: false
brew "steveyegge/beads/bd"
brew "withgraphite/tap/graphite"

# ── Casks — Apps ──────────────────────────────────────────
cask "ghostty"
cask "visual-studio-code"
cask "cursor"
cask "docker-desktop"
cask "figma"
cask "drawio"
cask "slack"
cask "postman"
cask "anki"

# ── Casks — Utilities ────────────────────────────────────
cask "1password-cli"
cask "claude-code"
cask "git-credential-manager"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "keymapp"
cask "maccy"
cask "stats"
cask "tailscale-app"

# ── Casks — Databases ────────────────────────────────────
cask "mongodb-compass"
cask "pgadmin4"
cask "tableplus"

# ── Casks — Fonts ────────────────────────────────────────
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"

# ── VS Code — AI ─────────────────────────────────────────
vscode "anthropic.claude-code"
vscode "openai.chatgpt"

# ── VS Code — Languages & Frameworks ─────────────────────
vscode "prisma.prisma"
vscode "mquandalle.graphql"
vscode "4ops.terraform"
vscode "tamasfe.even-better-toml"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"

# ── VS Code — Formatters & Linters ───────────────────────
vscode "esbenp.prettier-vscode"
vscode "charliermarsh.ruff"
vscode "astral-sh.ty"
vscode "sqlfluff.vscode-sqlfluff"

# ── VS Code — Python ─────────────────────────────────────
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-pyright.pyright"

# ── VS Code — Git & CI ───────────────────────────────────
vscode "eamodio.gitlens"
vscode "graphite.gti-vscode"
vscode "github.vscode-github-actions"
vscode "circleci.circleci"

# ── VS Code — Editor & Workflow ──────────────────────────
vscode "alefragnani.project-manager"
vscode "johnpapa.vscode-peacock"
vscode "tomrijndorp.find-it-faster"
vscode "streetsidesoftware.code-spell-checker"
vscode "davidanson.vscode-markdownlint"
vscode "yzhang.markdown-all-in-one"
vscode "tomoki1207.pdf"

# ── VS Code — Database ───────────────────────────────────
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"

# ── VS Code — Containers ─────────────────────────────────
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
